Autodesk.Revit.DB.TextNoteLeaderStyles
An enumerated type listing all the Leader styles.

Autodesk.Revit.DB.TextNoteLeaderStyles.LCS_TWO_SEG_LINE
The leader include two line segments.

Autodesk.Revit.DB.TextNoteLeaderStyles.LCS_ONE_SEG_ARC
The leader is an arc.

Autodesk.Revit.DB.TextNoteLeaderStyles.LCS_ONE_SEG_LINE
The leader only includes one line segment.

Autodesk.Revit.DB.TextNoteLeaderStyles.LCS_NONE
No leader.